[
  {
    "value": "Ab",
    "description": "The place on a SERP where an ad appeared (top, side, or bottom blocks)."
  },
  {
    "value": "Ac",
    "description": "Estimated budget spent buying keywords in Google AdWords for ads that appear in paid search results (monthly estimation)."
  },
  {
    "value": "Ad",
    "description": "Keywords a website is buying in Google AdWords for ads that appear in paid search results."
  },
  {
    "value": "Am",
    "description": "Changes in the number of paid keywords."
  },
  {
    "value": "At",
    "description": "Traffic brought to the website via paid search results."
  },
  {
    "value": "Bm",
    "description": "Changes in paid traffic."
  },
  {
    "value": "Cg",
    "description": "The total cost of all traffic driven to an analyzed domain with a given keyword over a specific period of time."
  },
  {
    "value": "Cm",
    "description": "Changes in paid traffic price."
  },
  {
    "name": "Competition",
    "value": "Co",
    "description": "Competitive density of advertisers using the given term for their ads. One (1) means the highest competition."
  },
  {
    "name": "CPC",
    "value": "Cp",
    "description": "Average price in US dollars advertisers pay for a user\u0027s click on an ad containing a particular keyword (Google AdWords)."
  },
  {
    "value": "Cr",
    "description": "Competition level based on the total number of keywords of each domain and the number of keywords the domains have in common."
  },
  {
    "value": "Cv",
    "description": "Keyword coverage represents the percentage of ads displayed for a particular keyword in the last 12 months (100% = 12 months)."
  },
  {
    "value": "Db",
    "description": "Regional database (US, UK, Italy, etc.)"
  },
  {
    "name": "Domain",
    "value": "Dn",
    "description": "Domain name."
  },
  {
    "value": "Ds",
    "description": "Ad text."
  },
  {
    "value": "Dt",
    "description": "Actual date."
  },
  {
    "name": "Keywords SERP Features",
    "value": "Fk",
    "description": "All SERP Features triggered by a keyword."
  },
  {
    "name": "SERP Features",
    "value": "Fp",
    "description": "SERP features in which a domain appears on SERP for a keyword."
  },
  {
    "value": "Fl",
    "description": "            (deprecated) SERP features in which a domain appears on SERP for a keyword.            \u003Ca href=\u0022#serp_features\u0022 class=\u0022cl-api-link\u0022\u003EList of available SERP Features\u003C/a\u003E        "
  },
  {
    "value": "FKn",
    "description": "            The total number of SERP Features triggered by the keywords that your domain ranks for. Columns with specified numbers should be separated with commas: FK1,FK2..FKn, where n is the number of a SERP feature from \u003Ca href=\u0022#serp_features\u0022 class=\u0022cl-api-link\u0022\u003Ethis list\u003C/a\u003E.        "
  },
  {
    "value": "FPn",
    "description": "            The total number of SERP Features that your domain ranks in. Columns with changed numbers should be separated with commas: FP1,FP2..FPn, where n is the number of a SERP feature from \u003Ca href=\u0022#serp_features\u0022 class=\u0022cl-api-link\u0022\u003Ethis list\u003C/a\u003E.        "
  },
  {
    "value": "Hs",
    "description": "This columns shows whether or not a report\u0027s line returns historical data."
  },
  {
    "value": "Ip",
    "description": "IP address."
  },
  {
    "value": "In",
    "description": "Keyword intents (0 - Commercial, 1 - Informational, 2 - Navigational, 3 - Transactional)."
  },
  {
    "value": "Ipu",
    "description": "The total number of positions with unknown intent."
  },
  {
    "value": "Ip0",
    "description": "The total number of positions with the Commercial intent."
  },
  {
    "value": "Ip1",
    "description": "The total number of positions with the Informational intent."
  },
  {
    "value": "Ip2",
    "description": "The total number of positions with the Navigational intent."
  },
  {
    "value": "Ip3",
    "description": "The total number of positions with the Transactional intent."
  },
  {
    "value": "Itu",
    "description": "The total amount of traffic with unknown intent."
  },
  {
    "value": "It0",
    "description": "The total amount of traffic with the Commercial intent."
  },
  {
    "value": "It1",
    "description": "The total amount of traffic with the Informational intent."
  },
  {
    "value": "It2",
    "description": "The total amount of traffic with the Navigational intent."
  },
  {
    "value": "It3",
    "description": "The total amount of traffic with the Transactional intent."
  },
  {
    "value": "Icu",
    "description": "The total cost of traffic with unknown intent."
  },
  {
    "value": "Ic0",
    "description": "The total cost of traffic with the Commercial intent."
  },
  {
    "value": "Ic1",
    "description": "The total cost of traffic with the Informational intent."
  },
  {
    "value": "Ic2",
    "description": "The total cost of traffic with the Navigational intent."
  },
  {
    "value": "Ic3",
    "description": "The total cost of traffic with the Transactional intent."
  },
  {
    "name": "Keyword Difficulty Index",
    "value": "Kd",
    "description": "An estimate of how difficult it would be to rank well in organic search results for a particular keyword. The higher the percentage, the harder it is to achieve high rankings for the given keyword."
  },
  {
    "value": "Lc",
    "description": "Number of API units per line."
  },
  {
    "value": "Li",
    "description": "Number of lines requested for a report by a particular user."
  },
  {
    "value": "Np",
    "description": "Common keywords that domains are ranking for in Google\u0027s top 100 organic search results."
  },
  {
    "name": "Search Volume",
    "value": "Nq",
    "description": "The average number of times users have searched for a given keyword per month. We calculate this value over the last 12 months."
  },
  {
    "name": "Number of Results",
    "value": "Nr",
    "description": "The total number of organic results returned for a given keyword at the last date of collection."
  },
  {
    "value": "Oc",
    "description": "Estimated price of organic keywords in Google AdWords."
  },
  {
    "value": "Of",
    "description": "Value of a parameter display_offset requested by a particular user."
  },
  {
    "value": "Om",
    "description": "Changes in the number of organic keywords."
  },
  {
    "value": "Or",
    "description": "Keywords that bring users to a website via Google\u0027s top 100 organic search results."
  },
  {
    "value": "Xn",
    "description": "            Organic Position Distribution. Keywords bringing users to the website via Google\u0027s top 100 organic search results are grouped depending on the domain’s ranking for them. Columns with specified numbers should be separated with commas: X0,X1..Xn, where n is:\u003Cbr\u003E            0: 1-3\u003Cbr\u003E            1: 4-10\u003Cbr\u003E            2: 11-20\u003Cbr\u003E            3: 21-30\u003Cbr\u003E            4: 31-40\u003Cbr\u003E            5: 41-50\u003Cbr\u003E            6: 51-60\u003Cbr\u003E            7: 61-70\u003Cbr\u003E            8: 71-80\u003Cbr\u003E            9: 81-90\u003Cbr\u003E            a: 91-100\u002B\u003Cbr\u003E        "
  },
  {
    "value": "Ot",
    "description": "Traffic brought to a website via Google\u0027s top 100 organic search results."
  },
  {
    "value": "P0",
    "description": "A position of the first queried domain for a particular keyword in Google\u0027s top 100 organic or paid search results."
  },
  {
    "value": "P1",
    "description": "A position of the second queried domain for a particular keyword in Google\u0027s top 100 organic or paid search results."
  },
  {
    "value": "P2",
    "description": "A position of the third queried domain for a particular keyword in Google\u0027s top 100 organic or paid search results."
  },
  {
    "value": "P3",
    "description": "A position of the fourth queried domain for a particular keyword in Google\u0027s top 100 organic or paid search results."
  },
  {
    "value": "P4",
    "description": "A position of the fifth queried domain for a particular keyword in Google\u0027s top 100 organic or paid search results."
  },
  {
    "value": "Pc",
    "description": "Number of keywords."
  },
  {
    "value": "Pd",
    "description": "The difference between the previous position a domain was earning with a particular keyword and its current position."
  },
  {
    "name": "Keyword",
    "value": "Ph",
    "description": "Keyword bringing users to the website via Google's top 100 organic search results."
  },
  {
    "value": "Po",
    "description": "Position a URL gets with a particular keyword in Google\u0027s top 100 organic or paid search results."
  },
  {
    "value": "Pp",
    "description": "A position a domain gets with a particular keyword in Google\u0027s top 100 organic or paid search results."
  },
  {
    "value": "Pr",
    "description": "Price of promoted product"
  },
  {
    "value": "Rh",
    "description": "The SEMrush rating of the website\u0027s popularity based on organic traffic coming from Google\u0027s top 100 organic search results."
  },
  {
    "value": "Rk",
    "description": "The SEMrush rating of the website\u0027s popularity based on organic traffic coming from Google\u0027s top 100 organic search results."
  },
  {
    "name": "Related Relevance",
    "value": "Rr",
    "description": "This indicator reflects the degree of relevance of result keyword to the seed keyword."
  },
  {
    "value": "Rt",
    "description": "Report type"
  },
  {
    "value": "Sh",
    "description": "Number of keywords the website is using for product listing ads."
  },
  {
    "value": "Sn",
    "description": "Shop name"
  },
  {
    "value": "Sv",
    "description": "Number of unique product listing ads (PLA Copies)"
  },
  {
    "value": "Tc",
    "description": "The percentage of the domain\u0027s total traffic cost that is attributed to a particular keyword."
  },
  {
    "value": "Tg",
    "description": "The amount of estimated organic traffic driven to an analyzed domain with a given keyword over a specific period of time."
  },
  {
    "name": "Trends",
    "value": "Td",
    "description": "The interest of searchers in a particular keyword during the last 12 months. This metric is based on changes in the number of queries per month."
  },
  {
    "value": "Tm",
    "description": "Changes in organic traffic."
  },
  {
    "value": "Tr",
    "description": "The share of traffic driven to the website with a particular keyword for a specified period."
  },
  {
    "value": "Ts",
    "description": "UNIX Timestamp."
  },
  {
    "value": "Tt",
    "description": "Ad title."
  },
  {
    "value": "Um",
    "description": "Changes in organic traffic cost."
  },
  {
    "value": "Un",
    "description": "Ad id"
  },
  {
    "name": "Url",
    "value": "Ur",
    "description": "The URL of the target page (Backlinks)."
  },
  {
    "value": "Vu",
    "description": "Visible URL."
  },
  {
    "value": "ads_count",
    "description": "The total number of all types of display ads (media and text) during a specified period."
  },
  {
    "value": "ads_overall",
    "description": "The total number of all types of display ads (media and text) for all time."
  },
  {
    "value": "advertisers_count",
    "description": "The total number of advertisers on Google’s Display Network where a publisher promoted a website in the last 7 days."
  },
  {
    "value": "advertisers_overall",
    "description": "The total number of advertisers on Google’s Display Network where a publisher promoted a website."
  },
  {
    "value": "anchor",
    "description": "A clickable text of a backlink."
  },
  {
    "value": "avg_positions",
    "description": "An average position of an ad."
  },
  {
    "value": "domain",
    "description": "Domain name."
  },
  {
    "value": "domain_overall",
    "description": "The total number of advertisers on Google’s Display Network where a publisher promoted a website, or the total number of publishers’ websites where the display ads of an advertiser\u0027s website appeared during a whole period."
  },
  {
    "value": "external_num",
    "description": "The number of the source page’s links that point to other websites’ pages."
  },
  {
    "value": "first_seen",
    "description": "The timestamp on which SEMrush first noticed a backlink."
  },
  {
    "value": "image_alt",
    "description": "A URL of an image backlink\u0027s location."
  },
  {
    "value": "internal_num",
    "description": "The number of the source page’s links that point to webpages of the same website."
  },
  {
    "value": "last_seen",
    "description": "The timestamp on which SEMrush last noticed a backlink."
  },
  {
    "value": "media_ads_count",
    "description": "The total number of media display ads of an advertiser SEMrush has noticed during a specified period."
  },
  {
    "value": "media_ads_overall",
    "description": "The total number of an advertiser’s media display ads SEMrush has noticed\u0026nbsp;for a whole period."
  },
  {
    "value": "media_type",
    "description": "The display ad’s type of media."
  },
  {
    "value": "publishers_count",
    "description": "The total number of publishers’ websites where display ads of an advertiser\u0027s website appeared in the last 7 days."
  },
  {
    "value": "publishers_overall",
    "description": "The total number of publishers’ websites where the display ads of an advertiser\u0027s website appeared during a whole period."
  },
  {
    "value": "redirect_url",
    "description": "The last URL in a redirect chain."
  },
  {
    "value": "response_code",
    "description": "Server response code."
  },
  {
    "value": "source_title",
    "description": "The title of the source page."
  },
  {
    "value": "source_size",
    "description": "The source page‘s size in bytes."
  },
  {
    "value": "source_url",
    "description": "The URL of the source page."
  },
  {
    "value": "target_title",
    "description": "The title of the target page."
  },
  {
    "value": "target_url",
    "description": "The URL of the target page (Backlinks)."
  },
  {
    "value": "target_url",
    "description": "The landing page of a display ad (Display Advertising)."
  },
  {
    "value": "text",
    "description": "The text of a display ad."
  },
  {
    "value": "text_ads_count",
    "description": "The total number of display ads during a specified period."
  },
  {
    "value": "text_ads_overall",
    "description": "The total number of display ads SEMrush noticed for a whole period."
  },
  {
    "value": "times_seen",
    "description": "The number of times SEMrush saw a display ad."
  },
  {
    "value": "title",
    "description": "The title of a display ad."
  },
  {
    "value": "type",
    "description": "The metrics indicates the backlink type"
  },
  {
    "value": "visible_url",
    "description": "A visible URL of a display ad."
  },
  {
    "value": "ascore",
    "description": "Authority Score is our proprietary metric used to measure overall quality of domain/URL and influence on SEO. The score is based on the number of backlinks, referring domains, organic search traffic, and other data."
  },
  {
    "value": "domain_ascore",
    "description": "Domain Authority Score is our proprietary metric used to measure overall quality of domain and influence on SEO. The score is based on the number of backlinks, referring domains, organic search traffic, and other data."
  },
  {
    "value": "page_ascore",
    "description": "Page Authority Score is our proprietary metric used to measure overall quality of URL and influence on SEO. The score is based on the number of backlinks, referring domains, organic search traffic, and other data."
  },
  {
    "value": "category_name",
    "description": "Name of the category. Categories may consist of one, two or three levels. Levels are divided by a slash (/). Example of one-level category: “/Business \u0026amp; Industrial”. Example of three-level category: “/Internet \u0026amp; Telecom/Web Services/Web Design \u0026amp; Development”"
  },
  {
    "value": "neighbour",
    "description": "A domain with a similar backlink profile to the analyzed domain."
  },
  {
    "value": "similarity",
    "description": "This metric is calculated based on the number of referring domains to each competitor and the total number of common referring domains to all competitors. If websites have a large number of common referring domains, they can be considered competitors."
  },
  {
    "value": "common_refdomains",
    "description": "The number of referring domains that link back to both the analyzed and competing domains."
  },
  {
    "value": "domains_num",
    "description": "The total number of domains, including common referring domains, linking to a given domain."
  },
  {
    "value": "backlinks_num",
    "description": "The number of backlinks to a given domain."
  }
]
